ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
#define MAIN_SHOW_C
#include "includes.h"

#if QT_EN
#include <mainwindow.h>
extern MainWindow *w;
#endif

/*
//每档速度的延时,单位为毫秒
const INT16U Step_Delay[]=
{
  10,
  20,
  30,
  40,
  50,
  60,
  70,
  80,
  90,
  100
};
*/
//获取某个窗口区域某个步进的停留时间
INT32U Get_Area_In_Step_Delay(INT8U Area_No)
{/*
    if(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed > 1)
      return MOVE_STEP_PERIOD + (Prog_Status.File_Para[Area_No].Pic_Para.In_Speed - 1) * MOVE_STEP_PERIOD*2; //CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);///(100/MOVE_STEP);
    else
      return MOVE_STEP_PERIOD;
	  */
#if QT_EN
    if(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed > 1)
      return MOVE_STEP_PERIOD + ((INT32U)Prog_Status.File_Para[Area_No].Pic_Para.In_Speed - 1) * MOVE_STEP_PERIOD; //CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);///(100/MOVE_STEP);
    else
      return MOVE_STEP_PERIOD;
#else
    if(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed > 1)
      return MOVE_STEP_PERIOD + ((INT32U)Prog_Status.File_Para[Area_No].Pic_Para.In_Speed - 1)* 2 * MOVE_STEP_PERIOD; //CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);///(100/MOVE_STEP);
    else
      return MOVE_STEP_PERIOD;
#endif
}

//获取某个窗口区域某个步进的停留时间
INT32U Get_Area_Out_Step_Delay(INT8U Area_No)
{	/*
    if(Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed > 1)
      return MOVE_STEP_PERIOD + (Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed - 1)* MOVE_STEP_PERIOD*2; //CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);///(100/MOVE_STEP);
    else
      return MOVE_STEP_PERIOD;
	  */
#if QT_EN
    if(Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed > 1)
      return MOVE_STEP_PERIOD + ((INT32U)Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed - 1) * MOVE_STEP_PERIOD; //CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);///(100/MOVE_STEP);
    else
      return MOVE_STEP_PERIOD;
#else
    if(Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed > 1)
      return MOVE_STEP_PERIOD + ((INT32U)Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed - 1) * 2 * MOVE_STEP_PERIOD; //CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);///(100/MOVE_STEP);
    else
      return MOVE_STEP_PERIOD;
#endif
}
/*
//获取文件引入时间
INT32U Get_File_In_Speed(INT8U Area_No)
{
 return CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);
  
}
*/
//获取文件的停留时间,单位为ms
//原参数最高为表示单位，0为s，1为ms
INT32U Get_File_Stay_Time(INT8U Area_No)
{
  return CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.Stay_Time);
}
/*
//获取文件引出时间
INT32U Get_File_Out_Speed(INT8U Area_No)
{
  return CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed);
}
*/
//设置文件的停留时间
void Set_File_Stay_Time(INT8U Area_No, INT16U ms)
{
  Prog_Status.File_Para[Area_No].Pic_Para.Stay_Time = ms;
  Prog_Status.File_Para[Area_No].Pic_Para.Stay_Time = Prog_Status.File_Para[Area_No].Pic_Para.Stay_Time | 0x8000;
}

//检查Area_No分区当前显示数据是否连移数据
INT8U Chk_Pic_Continuous_Move(INT8U Area_No)
{
    if(Prog_Status.Area_Status[Area_No].In_Mode >= 1 &&\
       Prog_Status.Area_Status[Area_No].In_Mode <= 2 &&\
       Get_File_Stay_Time(Area_No) EQ 0 &&\
       Prog_Status.File_Para[Area_No].Pic_Para.Flag EQ SHOW_PIC)
        return 1;
    else
        return 0;

}

//每隔MOVE_STEP_TIMER ms调用该函数,实现移动显示等效果
void Update_Show_Data(void)
{
  static INT8U i = 0;

  if(Screen_Status.Time_OC_Flag EQ CLOSE_FLAG ||\
     Screen_Status.Manual_OC_Flag EQ CLOSE_FLAG ||\
	 Chk_UDisk_Processing())
    return;

  if(Prog_Status.Play_Status.RT_Play_Time > 0) //当前在关机状态或者实时显示状态
	{/*
	  if(Prog_Status.Play_Status.RT_Play_Flag EQ RT_PLAY_FLAG)
	  {
	    Prog_Status.Play_Status.RT_Play_Time -= MOVE_STEP_PERIOD;
		if(Prog_Status.Play_Status.RT_Play_Time EQ 0)
		  RT_Play_Status_Exit();  
	  }    
	  */
	  return;
	}
/*
 for(i = 0; i < Prog_Para.Area_Num && i < MAX_AREA_NUM; i ++)
 {
  if(Chk_File_Play_Status(i) EQ 0)
    return;
  }
*/
 
  //for(i = 0; i < Prog_Para.Area_Num && i < MAX_AREA_NUM; i ++)
  if(i < Prog_Para.Area_Num && i < MAX_AREA_NUM) 
  {
      if(Screen_Status.Com_Time > 0) //收到一帧，先处理此帧
          return;
//#if PIC_SHOW_EN    
    //if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_PIC)
      Update_Pic_Data(i);
	  
#if BORDER_SHOW_EN
      Update_Border_Data(i); //更新边框数据
#endif


//#endif
/*
#if CLOCK_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_CLOCK)
      Update_Clock_Data(i);
#endif
      */
    /*
#if TIMER_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_TIMER)
      Update_Timer_Data(i);
#endif
      */
    /*
#if TIME_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_TIME)
      Update_Time_Data(i);
#endif
      */
    /*
#if TEMP_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_TEMP)
      Update_Temp_Data(i);
#endif
      */
    /*
#if LUN_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_LUN)
      Update_Lun_Data(i);
#endif
      */
  }

#if BORDER_SHOW_EN
      Update_Border_Data(MAX_AREA_NUM); //更新边框数据
#endif

  i++;

  if(!(i < Prog_Para.Area_Num && i < MAX_AREA_NUM))
    i = 0;

}

//更新显示备份区数据、显示非固定文本类信息
INT8U Update_XXX_Data(S_Show_Data *pDst, INT8U Area_No)
{
  INT8U Flag; 
  
  Flag = Prog_Status.File_Para[Area_No].Pic_Para.Flag;
  
  //某些非图文数据需要定时刷新!应该保证每分钟进入一次
  if(Flag EQ SHOW_PIC)
    ;
#if CLOCK_SHOW_EN  
  else if(Flag EQ SHOW_CLOCK)
    Update_Clock_Data(pDst, Area_No);
#endif
#if TIME_SHOW_EN  
  else if(Flag EQ SHOW_TIME)
    Update_Time_Data(pDst, Area_No);
#endif
#if TIMER_SHOW_EN  
  else if(Flag EQ SHOW_TIMER)
    Update_Timer_Data(pDst, Area_No);
#endif
#if TEMP_SHOW_EN  
  else if(Flag EQ SHOW_TEMP)
    Update_Temp_Data(pDst, Area_No);
#endif
#if LUN_SHOW_EN  
  else if(Flag EQ SHOW_LUN)
    Update_Lun_Data(pDst, Area_No);
#endif
#if HUMIDITY_SHOW_EN
  else if(Flag EQ SHOW_HUMIDITY)
    Update_Humidity_Data(pDst, Area_No);
#endif
#if NOISE_SHOW_EN
  else if(Flag EQ SHOW_NOISE)
    Update_Noise_Data(pDst, Area_No);
#endif
  else
    ASSERT_FAILED(); 
  
  return 1;
}

