ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
//清楚某个分区的状态
void Clr_Area_Status(INT8U Area_No)
{
  if(Area_No >= MAX_AREA_NUM)
  {
    ASSERT_FAILED();
    return;
  }
  
  memset((void *)&Prog_Status.Area_Status[Area_No], 0, sizeof(Prog_Status.Area_Status[Area_No]));
  SET_HT(Prog_Status.Area_Status[Area_No]);
}
/*
void Clr_All_Area_Status()
{
    INT8U i;

    for(i = 0; i < MAX_AREA_NUM; i++)
    {
        Clr_Area_Status(i);
    }
}
*/

void Clr_Show_Bak_Data(void)
{

}

void Clr_Show_Data(void)
{
  //if(Screen_Para.Scan_Para.Data_Polarity EQ 0)
    //memset(Show_Data.Color_Data, 0xFF, sizeof(Show_Data.Color_Data));
  //else
    memset(Show_Data.Color_Data, 0x00, sizeof(Show_Data.Color_Data));
}

void Set_Show_Data(void)
{
 // if(Screen_Para.Scan_Para.Data_Polarity EQ 0)
   // memset(Show_Data.Color_Data, 0x00, sizeof(Show_Data.Color_Data));
  //else
    memset(Show_Data.Color_Data, 0xFF, sizeof(Show_Data.Color_Data));
}
/*
void Clr_All_Show_Data(void)
{
  Clr_Show_Data();

  memset(Show_Data_Bak.Color_Data, 0, sizeof(Show_Data_Bak.Color_Data));
  SET_HT(Show_Data);
  SET_HT(Show_Data_Bak);
}
*/

//读取连移数据
void Read_Continous_Move_Show_Data(S_Show_Data *pDst, INT8U Area_No)
{
    INT16U Area_Width, Area_Height, Border_Height,i,j;

    Area_Width = Get_Area_Width(Area_No);
    Area_Height = Get_Area_Height(Area_No);
    Border_Height = Get_Area_Border_Height(Area_No);

    if(Area_Height > 2*Border_Height)
        Area_Height = Area_Height - 2*Border_Height;
    else
        return;

    if(Area_Width > 2*Border_Height)
        Area_Width = Area_Width - 2*Border_Height;
    else
        return;

    //左平移或者连续左移
    if(Prog_Status.Area_Status[Area_No].In_Mode EQ 1 ||\
       Prog_Status.Area_Status[Area_No].In_Mode EQ 3)
    {
        for(j = 0; j < Area_Height; j ++)
        {
           i = Prog_Status.Area_Status[Area_No].In_Step;
             Read_Show_Data_Point(Area_No, \
                                  Prog_Status.Area_Status[Area_No].File_No, \
                                  (U_File_Para *)&Prog_Status.File_Para[Area_No], \
                                  Prog_Status.Area_Status[Area_No].SCN_No,\
                                  pDst, \
                                  i, \
                                  j);
        }
    }
    else if(Prog_Status.Area_Status[Area_No].In_Mode EQ 2 ||\
            Prog_Status.Area_Status[Area_No].In_Mode EQ 5)//连续上移或者上移
    {
        for(i = 0; i < Area_Width; i = i+8)
        {
             j = Prog_Status.Area_Status[Area_No].In_Step;
             Read_Show_Data_Point(Area_No, \
                                  Prog_Status.Area_Status[Area_No].File_No, \
                                  (U_File_Para *)&Prog_Status.File_Para[Area_No], \
                                  Prog_Status.Area_Status[Area_No].SCN_No,\
                                  pDst, \
                                  i, \
                                  j);
        }
    }
    else if(Prog_Status.Area_Status[Area_No].In_Mode EQ 4) //右平移
    {
        for(j = 0; j < Area_Height; j ++)
        {
           i = Prog_Status.Area_Status[Area_No].In_Max_Step - Prog_Status.Area_Status[Area_No].In_Step;
             Read_Show_Data_Point(Area_No, \
                                  Prog_Status.Area_Status[Area_No].File_No, \
                                  (U_File_Para *)&Prog_Status.File_Para[Area_No], \
                                  Prog_Status.Area_Status[Area_No].SCN_No,\
                                  pDst, \
                                  i, \
                                  j);
        }
    }
    else//下平移
    {
        for(i = 0; i < Area_Width; i = i+8)
        {
             j = Prog_Status.Area_Status[Area_No].In_Max_Step - Prog_Status.Area_Status[Area_No].In_Step;
             Read_Show_Data_Point(Area_No, \
                                  Prog_Status.Area_Status[Area_No].File_No, \
                                  (U_File_Para *)&Prog_Status.File_Para[Area_No], \
                                  Prog_Status.Area_Status[Area_No].SCN_No,\
                                  pDst, \
                                  i, \
                                  j);
        }
    }
}

//检查Area_No当前播放文件是否播放当此完毕?
INT8U Chk_File_Play_End(INT8U Area_No)
{
    if(Prog_Status.Area_Status[Area_No].SCN_No >= Prog_Status.File_Para[Area_No].Pic_Para.SNum)
    {
        Prog_Status.Area_Status[Area_No].New_File_Flag = NEW_FLAG;

        Prog_Status.Area_Status[Area_No].Play_Counts ++;
        if(Prog_Status.Area_Status[Area_No].Play_Counts >= Prog_Status.File_Para[Area_No].Pic_Para.Play_Counts)
        {
          Prog_Status.Area_Status[Area_No].File_No ++;
          Prog_Status.Area_Status[Area_No].Play_Counts = 0;
        }
        SET_SUM(Prog_Status.Area_Status[Area_No]);
        return 1;
    }
    else
        return 0;

}

//读取一屏显示数据
//prog节目号
//area分区号
INT8U Update_Show_Data_Bak(INT8U Prog_No, INT8U Area_No)
{
  INT16U Len;//,SNum;
  INT16S Len0,Len1;
  INT16U X,Y,Width,Height;
  INT8U Re = 1;
  //INT8U File_No;
  //INT8U Counts;

  Re &= CHK_SUM(Prog_Status.Play_Status);
  if(Re EQ 0)
      ASSERT_FAILED();
  Re &= CHK_SUM(Prog_Status.Area_Status[Area_No]);
  if(Re EQ 0)
      ASSERT_FAILED();
  Re &= CHK_SUM(Prog_Para);
  if(Re EQ 0)
      ASSERT_FAILED();

  //所有分屏都显示了则切换到下个显示文件
  if(Prog_Status.Play_Status.New_Prog_Flag) //在节目更新状态中，不更新文件参数
      return 0;

  //if(Prog_Para.Area_File_Num[Area_No] EQ 0)
      //return 0;
/*
  if(Prog_Status.Area_Status[Area_No].New_File_Flag EQ 0 &&\
     Prog_Status.Area_Status[Area_No].New_SCN_Flag > 0)
  {
      if(Prog_Status.Area_Status[Area_No].SCN_No >= Prog_Status.File_Para[Area_No].Pic_Para.SNum)
      {
          Prog_Status.Area_Status[Area_No].New_File_Flag = NEW_FLAG; //到了最后一屏则切换到下一个文件
          Prog_Status.Area_Status[Area_No].File_No ++;
          SET_SUM(Prog_Status.Area_Status[Area_No]);
      }
  }
*/
  TRACE();

  //检查是否需要更新到下一文件
  if(Prog_Status.Area_Status[Area_No].New_File_Flag)//SNum > Prog_Status.File_Para[Area_No].Pic_Para.SNum)
  {
      TRACE();

    //debug("prog %d area %d file %d play end!", Prog_Status.Play_Status.Prog_No, Area_No, Prog_Status.Area_Status[Area_No].File_No);

    Prog_Status.Area_Status[Area_No].SCN_No = 0;
    SET_SUM(Prog_Status.Area_Status[Area_No]);
    //文件参数读取失败则切换到下个文件

