ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
          Clr_All_Show_Data();

          //memcpy((INT8U *)&(pProg_Para->Prog_No), Pub_Buf, sizeof(S_Prog_Para) - CHK_BYTE_LEN);
          //void Draw_Border(S_Show_Data *pDst, INT8U Area_No, INT8U *pData, INT8U Width, INT8U Height,  INT32U Step)
          if(Prog_Para.Border_Check)
          Draw_Border(&Show_Data_Bak, MAX_AREA_NUM, Pub_Buf + sizeof(S_Prog_Para) - CHK_BYTE_LEN, 0,0);

          Prog_Status.Play_Status.Last_Prog_No = Prog_No;
          Prog_Status.Play_Status.New_Prog_Flag = 0;
          //SET_HT(Prog_Status.Play_Status);
          SET_SUM(Prog_Status.Play_Status);

          for(i = 0; i < MAX_AREA_NUM; i ++)
          {
            Prog_Status.Area_Status[i].New_File_Flag = NEW_FLAG;
            Prog_Status.Area_Status[i].File_No = 0;
            Prog_Status.Area_Status[i].SCN_No = 0;

            Prog_Status.Area_Status[i].Last_File_No = 0xFF;
            Prog_Status.Area_Status[i].Last_SCN_No = 0xFFFF;
            SET_SUM(Prog_Status.Area_Status[i]);
          }
        }
      }
      else
      {
        TRACE();

        Prog_Status.Play_Status.New_Prog_Flag = NEW_FLAG;
        Prog_Status.Play_Status.Prog_No ++;
        SET_SUM(Prog_Status.Play_Status);

        ASSERT_FAILED();
        if(Len EQ 0)
          debug("read prog para failed");
        else
          debug("prog %d now not play time", Prog_Status.Play_Status.Prog_No);
      }

      //Prog_Status.Play_Status.Prog_No ++; //在没有读到节目参数的情况下，读取下一个节目的参数
      //最多查询次数不超过Screen_Para.Prog_Num和MAX_PROG_NUM次
      //if(Count > Screen_Para.Prog_Num || Count > MAX_PROG_NUM)
        //break;
    }
  //}
}

#if DATA_PREP_EN >0
//检查是否更新预准备数据
void Check_Update_Data_Prep(void)
{
  INT8U Prog_No,File_Flag;
  INT8U File_No, Prog_End_Flag;
  INT16U SNum,Len;
  INT16U Counts,i,j,X,Y,Width,Height;
  

  if(Prog_Status.Play_Status.New_Prog_Flag)
    return;
  
  //准备每个分区的参数和数据
  for(i =0; i < Prog_Para.Area_Num && i < MAX_AREA_NUM; i ++)
  {
      if(Screen_Status.Rcv_Flag EQ FRAME_FLAG) //收到一帧，先处理此帧
          return;

    if(Prog_Status.Area_Status[i].New_File_Flag ||\
       Prog_Status.Area_Status[i].New_SCN_Flag ||\
       Prog_Status.Area_Status[i].New_CStep_Flag)
      return;
    
    //获取下一屏数据
    if(GET_VAR(Prep_Data.Data_Read_Flag[i]) EQ DATA_READ) //需要获取下一屏的参数
    {
      SET_VAR(Prep_Data.Data_Read_Flag[i] , 0);
      SNum = Prog_Status.Area_Status[i].SCN_No + 1; //下一个屏号

      Prog_No = Prog_Status.Play_Status.Prog_No;
      File_No = Prog_Status.Area_Status[i].File_No;
            
      if(SNum >= Prog_Status.File_Para[i].Pic_Para.SNum) //读取下个文件
      {
        SNum = 0;
        File_No ++; 
        if(File_No >= Prog_Para.Area_File_Num[i])
          File_No = 0;

        //重新读取文件参数
        if(GET_VAR(Prep_Data.File_Para_Read_Flag[i]) EQ DATA_READ)
        {
          debug("\r\nprepaid prog %d, area %d,file %d para", Prog_No, i, File_No);
          
          SET_VAR(Prep_Data.File_Para_Read_Flag[i], 0);

          if(GET_VAR(Prep_Data.File_Para_Ok_Flag[i]) != DATA_OK ||\
             GET_VAR(Prep_Data.Para_Prog_No[i]) != Prog_No ||\
             GET_VAR(Prep_Data.Para_File_No[i]) != File_No)
          {
              Len = Read_File_Para(Prog_No, i, File_No, \
                 &Prep_Data.File_Para[i].Pic_Para.Flag, &Prep_Data.File_Para[i], sizeof(Prep_Data.File_Para[i]));

              SET_VAR(Prep_Data.Para_Prog_No[i], Prog_No);
              SET_VAR(Prep_Data.Para_File_No[i] , File_No);
              SET_VAR(Prep_Data.File_Para_Ok_Flag[i], (Len >0)?DATA_OK:DATA_ERR);

              if(Len EQ 0)
                return;

              debug("\r\nprepaid prog %d, area %d, file %d, scn %d data",Prog_No, i, File_No, SNum);

              if(GET_VAR(Prep_Data.Data_Ok_Flag[i]) != DATA_OK ||\
                 GET_VAR(Prep_Data.Data_Prog_No[i]) != Prog_No ||\
                 GET_VAR(Prep_Data.Data_SCN_No[i]) != SNum)
              {
                  Len = Read_Show_Data(i, \
                               File_No, \
                               &Prep_Data.File_Para[i],\
                               SNum,\
                               &Prep_Data.Show_Data,&X,&Y,&Width,&Height);

                  SET_VAR(Prep_Data.Data_Prog_No[i] , Prog_No);
                  SET_VAR(Prep_Data.Data_File_No[i] , File_No);
                  SET_VAR(Prep_Data.Data_SCN_No[i] , SNum);
                  SET_VAR(Prep_Data.Data_X[i] , X);
                  SET_VAR(Prep_Data.Data_Y[i] , Y);
                  SET_VAR(Prep_Data.Data_Width[i] , Width);
                  SET_VAR(Prep_Data.Data_Height[i] , Height);
                  SET_VAR(Prep_Data.Data_Ok_Flag[i] , (Len > 0)?DATA_OK:DATA_ERR);
             }
              return;
          }
        }
      }

      debug("\r\nprepaid prog %d, area %d, file %d, scn %d data",Prog_No, i, File_No, SNum);

      if(GET_VAR(Prep_Data.Data_Ok_Flag[i]) != DATA_OK ||\
         GET_VAR(Prep_Data.Data_Prog_No[i]) != Prog_No ||\
         GET_VAR(Prep_Data.Data_SCN_No[i]) != SNum)
      {
          Len = Read_Show_Data(i, \
                       File_No, \
                       &Prog_Status.File_Para[i],\
                       SNum,\
                       &Prep_Data.Show_Data, &X, &Y, &Width, &Height);

         SET_VAR(Prep_Data.Data_Prog_No[i] , Prog_No);
         SET_VAR(Prep_Data.Data_File_No[i] , File_No);
         SET_VAR(Prep_Data.Data_SCN_No[i] , SNum);
         SET_VAR(Prep_Data.Data_X[i] , X);
         SET_VAR(Prep_Data.Data_Y[i] , Y);
         SET_VAR(Prep_Data.Data_Width[i] , Width);
         SET_VAR(Prep_Data.Data_Height[i] , Height);
         SET_VAR(Prep_Data.Data_Ok_Flag[i] , (Len > 0)?DATA_OK:DATA_ERR);
     }
      
    }
  }  
  
}
#endif

//检查内存中的数据或者参数是否正确
void Check_Show_Data_Para(void)
{
  INT8U i, Re = 1;
  //INT8U Flag;

  Re &= CHK_HT(Screen_Para);
  Re &= CHK_HT(Prog_Num);  
  Re &= CHK_HT(Prog_Para);
  Re &= CHK_HT(Prog_Status);
  Re &= CHK_HT(Cur_Block_Index);
  Re &= CHK_HT(Show_Data);
  Re &= CHK_HT(Show_Data_Bak);
  Re &= CHK_HT(Cur_Time);
  if(Re EQ 0)
    ASSERT_FAILED();

  for(i = 0; i < S_NUM(Prog_Status.Area_Status); i ++)
  {
    Re = CHK_HT(Prog_Status.Area_Status[i]);
    if(Re EQ 0)
      ASSERT_FAILED();

    Re = CHK_SUM(Prog_Status.Area_Status[i]);
    if(Re EQ 0)
        ASSERT_FAILED();

    Re = Chk_File_Para_HT_Sum((U_File_Para *)&Prog_Status.File_Para[i]);
    if(Re EQ 0)
        ASSERT_FAILED();
  }
}

//进入实时显示状态
void RT_Play_Status_Enter(INT16U Sec)
{
  //if(Area_No EQ 0)
  {
    //Prog_Status.Play_Status.RT_Play_Flag = RT_PLAY_FLAG;
	Prog_Status.Play_Status.RT_Play_Time = Sec;//*1000; //ms为单位
    SET_SUM(Prog_Status.Play_Status);
  }/*
  else if(Area_No <= MAX_AREA_NUM)
  {
    Prog_Status.Area_Status[Area_No] = RT_PLAY_FLAG;
	SET_SUM(Screen_Status);
  }
  else
    ASSERT_FAILED();
	*/
}

