ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
//退出实时显示状态
void RT_Play_Status_Exit(void)
{
    //Prog_Status.Play_Status.RT_Play_Flag = 0;
	Prog_Status.Play_Status.RT_Play_Time = 0;
    SET_SUM(Prog_Status.Play_Status);
}

void Prog_Status_Init(void)
{
    INT8U i;

  memset((void *)&Prog_Status, 0, sizeof(Prog_Status));
  SET_HT(Prog_Status);
  for(i = 0; i < MAX_AREA_NUM; i ++)
  {
      SET_HT(Prog_Status.Area_Status[i]);

      Prog_Status.Area_Status[i].Last_File_No = 0xFF;
      Prog_Status.Area_Status[i].Last_SCN_No = 0xFFFF;

      SET_SUM(Prog_Status.Area_Status[i]);

      Set_File_Para_HT_Sum((U_File_Para *)&Prog_Status.File_Para[i]);
      if(Chk_File_Para_HT_Sum((U_File_Para *)&Prog_Status.File_Para[i]) EQ 0)
          ASSERT_FAILED();
  }

  SET_HT(Prog_Status.Play_Status);
  SET_SUM(Prog_Status.Play_Status);
}

//将内存中的变量初始化头尾
void Ram_Init(void)
{
  //INT8U i;
  memset(&Show_Data, 0x00, sizeof(Show_Data));
  memset(&Show_Data_Bak, 0, sizeof(Show_Data_Bak));

  memset(&Screen_Para, 0, sizeof(Screen_Para));
  memset(&Prog_Num, 0, sizeof(Prog_Num));
  memset(&Prog_Para, 0, sizeof(Prog_Para));

  memset((void *)&Screen_Status, 0, sizeof(Screen_Status));
  Screen_Status.Time_OC_Flag = CLOSE_FLAG;

  memset((void *)&Prog_Status, 0, sizeof(Prog_Status));

#if DATA_PREP_EN >0
  memset(&Prep_Data, 0, sizeof(Prep_Data));
#endif  

  memset(&Cur_Block_Index, 0, sizeof(Cur_Block_Index));
  memset(&Cur_Time, 0, sizeof(Cur_Time));

  SET_HT(Screen_Para);
  SET_HT(Prog_Num);
  SET_HT(Prog_Para);
  SET_HT(Screen_Status);
#if DATA_PREP_EN >0
  SET_HT(Prep_Data);
#endif  
  SET_HT(Cur_Block_Index);
  SET_HT(Show_Data);
  SET_HT(Show_Data_Bak);
  SET_HT(Cur_Block_Index);
  SET_HT(Cur_Time);
  SET_HT(Pub_Timer);

  Prog_Status_Init();

  Prog_Status.Play_Status.New_Prog_Flag = 0;
  Prog_Status.Play_Status.Last_Prog_No = 0xFF;
  SET_HT(Prog_Status.Play_Status);
  SET_SUM(Prog_Status.Play_Status);
/*
#if QT_EN EQ 0
  memset(Scan_Data, 0xFF, sizeof(Scan_Data));
  memset(Scan_Data0, 0xFF, sizeof(Scan_Data0));
#endif
*/
}
/*
//特效处理函数，定时调用
void Effect_Proc(void)
{
  static S_Int32U Ms_Timer = {CHK_BYTE, 0x00, CHK_BYTE};
  //if(Prog_Status.Play_Status.Effect_Flag > 0)
  if(Pub_Timer.Ms >= MOVE_STEP_PERIOD + Ms_Timer.Var)
  {
    Ms_Timer.Var = Pub_Timer.Ms; 

    Prog_Status.Play_Status.Effect_Counts = 0;
    Prog_Status.Play_Status.Effect_Flag = 0;
	
    Show_Timer_Proc();

	if(Prog_Status.Play_Status.Effect_Counts >= Prog_Status.Play_Status.Max_Effect_Counts)	//自适应速度调节，
	  Prog_Status.Play_Status.Max_Effect_Counts = Prog_Status.Play_Status.Effect_Counts + 15;
  }
}
*/
//显示相关处理
void Show_Main_Proc(void)
{
  Screen_Proc();
 
  if(Get_Screen_Open_Status() != CLOSE_FLAG) //当前在开机状态才进入
  {
    Check_RT_Play_Status();
    Check_Update_Program_Para(); //检查是否需要更新节目
    Check_Update_Show_Data_Bak(); //检查是否需要更新显示备份区数据
	//Effect_Proc();
#if DATA_PREP_EN >0    
    Check_Update_Data_Prep();
#endif    
    Check_Show_Data_Para();
  }
}

//建立一个实时显示区域,并保存原来的显示参数
void Set_RT_Show_Area(INT16U X, INT16U Y, INT16U Width, INT16U Height)
{
//---备份当前参数
  RT_Show_Para.Area_Num = Prog_Para.Area_Num;
  RT_Show_Para.X = Prog_Para.Area[0].X;
  RT_Show_Para.Y = Prog_Para.Area[0].Y;
  RT_Show_Para.X_Len = Prog_Para.Area[0].X_Len;
  RT_Show_Para.Y_Len = Prog_Para.Area[0].Y_Len;	 
  RT_Show_Para.Time_OC_Flag = Screen_Status.Time_OC_Flag;
  //RT_Show_Para.Screen_Width = Screen_Para.Base_Para.Width;
  //RT_Show_Para.Screen_Height = Screen_Para.Base_Para.Height;
  //RT_Show_Para.Screen_Color = Screen_Para.Base_Para.Color;
  SET_HT(RT_Show_Para);

  Prog_Para.Area_Num = 1; //分区数1
  Prog_Para.Area[0].X = X;
  Prog_Para.Area[0].Y = Y;
  Prog_Para.Area[0].X_Len = Width;//Screen_Para.Base_Para.Width;
  Prog_Para.Area[0].Y_Len = Height;//Screen_Para.Base_Para.Height;
  SET_SUM(Prog_Para);

  //Screen_Para.Base_Para.Width = Width;
  //Screen_Para.Base_Para.Height = Height;
  //Screen_Para.Base_Para.Color = 0x01;
  //SET_SUM(Screen_Para);
 
  Screen_Status.Time_OC_Flag = OPEN_FLAG;
}

//恢复显示参数
void Restore_Show_Area(void)
{
  Prog_Para.Area_Num =RT_Show_Para.Area_Num; //分区数1
  Prog_Para.Area[0].X = RT_Show_Para.X;
  Prog_Para.Area[0].Y = RT_Show_Para.Y;
  Prog_Para.Area[0].X_Len = RT_Show_Para.X_Len;//Screen_Para.Base_Para.Width;
  Prog_Para.Area[0].Y_Len = RT_Show_Para.Y_Len;//Screen_Para.Base_Para.Height;
  SET_SUM(Prog_Para);

  //Screen_Para.Base_Para.Width = RT_Show_Para.Screen_Width;
  //Screen_Para.Base_Para.Height = RT_Show_Para.Screen_Height;
  //Screen_Para.Base_Para.Color = RT_Show_Para.Screen_Color;
  //SET_SUM(Screen_Para);
  Screen_Status.Time_OC_Flag = RT_Show_Para.Time_OC_Flag;
}




 //根据format和ap参数表输出调试信息
 // INT16U LED_Print(INT8U Font, INT8U Color, S_Show_Data *pData, INT8U Area_No, INT16U X, INT16U Y, const INT8S *format,...)

//显示初始化
void Para_Init(void)
{
  Ram_Init();
  Read_Screen_Para();
  Read_Prog_Num();
  Calc_Screen_Color_Num(); //计算屏幕颜色个数
  Build_Scan_Data_Index(); //构建索引表
}

void Para_Show(void)
{/*
  INT16U Len;
  //INT8U IP[4];
  //INT32U Baud; //串口波特率

 //显示板卡地址和串口波特率

  Len = RT_LED_Print(FONT0, 0x01, 0, 0, 3, "%d-%d", Screen_Para.COM_Para.Addr, Screen_Para.COM_Para.Baud);

#if UDISK_EN  
  memcpy(IP, &Screen_Para.ETH_Para.IP, 4);	//显示IP地址和端口号
  Len = RT_LED_Print(FONT0, 0x01, Len, 0, 3, "%d.%d.%d.%d:%d", IP[3], IP[2], IP[1], IP[0], Screen_Para.ETH_Para.Port);
#endif
  */
}

void Print_Cur_Time(void)
{
  debug("cur time: %2d-%2d-%2d %2d:%2d:%2d", Cur_Time.Time[T_YEAR], Cur_Time.Time[T_MONTH], Cur_Time.Time[T_DATE],\
                                             Cur_Time.Time[T_HOUR], Cur_Time.Time[T_MIN], Cur_Time.Time[T_SEC]);
}

//对屏幕进行测试
void Screen_Test(void)
{
  INT16U i, j;
  S_Point P0,P1;
  INT8U Test_Key_Up_Flag;

#if 0
   Screen_Para.Base_Para.Width = 64; 
   Screen_Para.Base_Para.Height = 256;
   Screen_Para.Base_Para.Color = 0x03;
   Screen_Status.Color_Num = 2;

   Screen_Para.Scan_Para.Direct = 0x02;//0x03;
   Screen_Para.Scan_Para.Rows_Fold = 0x00;//0x01;
   Screen_Para.Scan_Para.Cols_Fold = 0x00;//0x02;
   Screen_Para.Scan_Para.Rows = 16;
   Screen_Para.Scan_Para.Data_Polarity = 0;

   Screen_Status.Time_OC_Flag = 0;

   memset((INT8U *)Show_Data.Color_Data, 0x01, sizeof(Show_Data.Color_Data));

